RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_spi.c
  /*---------------------------- SPIx FIFO Control Register Configuration ----------------------------------*/
  SPIx->FCR = SPI_InitStruct->SPI_FIFO | SPI_InitStruct->SPI_TxFIFOTriggerLevel |
             (SPI_InitStruct->SPI_RxFIFOTriggerLevel << 4);

  /*---------------------------- SPIx Clock Prescaler Register Configuration -------------------------------*/
  #if (LIBCFG_SPI_CLK_PRE_V01)
  SPIx->CPR = (SPI_InitStruct->SPI_ClockPrescaler - 1);
  #else
  SPIx->CPR = (SPI_InitStruct->SPI_ClockPrescaler / 2) - 1;
  #endif
}

/*********************************************************************************************************//**
 * @brief Fill each SPI_InitStruct member with its default value.
 * @param SPI_InitStruct: pointer to an SPI_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void SPI_StructInit(SPI_InitTypeDef* SPI_InitStruct)
{
  /* Initialize the SPI_Mode member                                                                         */
  SPI_InitStruct->SPI_Mode = SPI_SLAVE;

  /* Initialize the SPI_FIFO member                                                                         */
  SPI_InitStruct->SPI_FIFO = SPI_FIFO_DISABLE;

  /* Initialize the SPI_DataLength member                                                                   */
  #if (LIBCFG_SPI_DATA_LENGTH_V01)
  SPI_InitStruct->SPI_DataLength = SPI_DATALENGTH_8;
  #else
  SPI_InitStruct->SPI_DataLength = SPI_DATALENGTH_16;
  #endif

  /* Initialize the SPI_SELMode member                                                                      */
  SPI_InitStruct->SPI_SELMode = SPI_SEL_SOFTWARE;

  /* Initialize the SPI_SELPolarity member                                                                  */
  SPI_InitStruct->SPI_SELPolarity = SPI_SELPOLARITY_LOW;

  /* Initialize the SPI_CPOL member                                                                         */
  SPI_InitStruct->SPI_CPOL = SPI_CPOL_LOW;

  /* Initialize the SPI_CPHA member                                                                         */
  SPI_InitStruct->SPI_CPHA = SPI_CPHA_FIRST;

  /* Initialize the SPI_FirstBit member                                                                     */
  SPI_InitStruct->SPI_FirstBit = SPI_FIRSTBIT_MSB;

  /* Initialize the SPI_RxFIFOTriggerLevel member                                                           */
  SPI_InitStruct->SPI_RxFIFOTriggerLevel = 0;

  /* Initialize the SPI_TxFIFOTriggerLevel member                                                           */
  SPI_InitStruct->SPI_TxFIFOTriggerLevel = 0;

  /* Initialize the SPI_ClockPrescaler member                                                               */
  SPI_InitStruct->SPI_ClockPrescaler = 2;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified SPI peripheral.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void SPI_Cmd(HT_SPI_TypeDef* SPIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected SPI peripheral                                                                   */
    SPIx->CR0 |= CR0_SPIEN_SET;
  }
  else
  {
    /* Disable the selected SPI peripheral                                                                  */
    SPIx->CR0 &= CR0_SPIEN_RESET;
  }
}

#if (!LIBCFG_SPI_NO_MULTI_MASTER)
/*********************************************************************************************************//**
 * @brief Enable or Disable the SEL output for the specified SPI peripheral.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void SPI_SELOutputCmd(HT_SPI_TypeDef* SPIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    SPIx->CR0 |= CR0_SELOEN_SET;
  }
  else
  {
    SPIx->CR0 &= CR0_SELOEN_RESET;
  }
}
#endif

/*********************************************************************************************************//**
 * @brief Enable or Disable SPI FIFO.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void SPI_FIFOCmd(HT_SPI_TypeDef* SPIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    SPIx->FCR |= FCR_FIFOEN_SET;
  }
  else
  {
    SPIx->FCR &= FCR_FIFOEN_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Configure the data length for the selected SPI.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_DataLength: specify data length of the SPI.
 * @retval None
 ************************************************************************************************************/
void SPI_SetDataLength(HT_SPI_TypeDef* SPIx, u16 SPI_DataLength)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_DATALENGTH(SPI_DataLength));

  /* Clear DFL[x:0] in CR1.
     if Datalength is 16-bit mode, then x = 3
     if Datalength is 8-bit mode, then x = 2                                                                */
  SPIx->CR1 &= (u32)~CR1_DFL_MASK;

  /* Set new DFL[x:0] in CR1.
     if Datalength is 16-bit mode, then x = 3
     if Datalength is 8-bit mode, then x = 2                                                                */
  SPIx->CR1 |= SPI_DataLength;
}

