RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_spi.c
/*********************************************************************************************************//**
 * @brief Configure the direction of SIO pins in dual or quad mode.
 * @param SPIx: where SPIx is the selected QSPI from the QSPI peripherals.
 * @param SIO_DIR_INorOUT:
 *   This parameter can be one of below:
 *     @arg SIO_DIR_IN  : The SIO pins are input mode
 *     @arg SIO_DIR_OUT : The SIO pins are output mode
 * @retval None
 ************************************************************************************************************/
void QSPI_DirectionConfig(HT_SPI_TypeDef* SPIx, SIO_DIR_Enum SIO_DIR_INorOUT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_QSPI(SPIx));
  Assert_Param(IS_SIO_DIR(SIO_DIR_INorOUT));

  while (SPIx->SR & SPI_FLAG_BUSY);      /* Wait until SPI NOT BUSY                                         */

  if (SIO_DIR_INorOUT != SIO_DIR_IN)
    SPIx->CR0 |= CR0_QDIODIR_OUT;
  else
    SPIx->CR0 &= CR0_QDIODIR_IN;
}
#endif

/*********************************************************************************************************//**
 * @brief Enable or Disable the SPIx guard time selection function.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void SPI_GUARDTCmd(HT_SPI_TypeDef* SPIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  (NewState == ENABLE) ? (SPIx->CR0 |= CR0_GUADTEN_SET) : (SPIx->CR0 &= CR0_GUADTEN_RESET);
}

/*********************************************************************************************************//**
 * @brief Set the SPIx guard time length.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param Guard_Time: number of SCK to be the guard time length.
 *   This parameter can be: SPI_GUADTIME_1_SCK to SPI_GUADTIME_16_SCK.
 * @retval None
 ************************************************************************************************************/
void SPI_GUARDTConfig(HT_SPI_TypeDef* SPIx, u32 Guard_Time)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_GUADTIME(Guard_Time));

  SPIx->CR0 = (SPIx->CR0 & 0xF0FF) | (Guard_Time << 8);
}

/*********************************************************************************************************//**
 * @brief Set the SPIx chip select hold time.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param CS_Hold_Time: number of SCK to be the hold time length.
 *   This parameter can be: 0 ~ 15
 * @retval None
 ************************************************************************************************************/
void SPI_SELHTConfig(HT_SPI_TypeDef* SPIx, u32 CS_Hold_Time)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_SELHOLDTIME(CS_Hold_Time));

  SPIx->CR0 = (SPIx->CR0 & 0x0FFF) | (CS_Hold_Time << 12);
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
